examples/general/example_request_additional_info.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:root="urn:fi:tulli:wsdl_root.002" xmlns:head001="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:auth001="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" xmlns:fin012="urn:fin.012.001.04">
    <soapenv:Body>
        <root:ApplicationRequest id="applicationRequest">
            <head001:AppHdr>Include application header details..</head001:AppHdr>
            <auth001:Document>
                <auth001:InfReqOpng>
                    <auth001:InvstgtnId>ABC1234</auth001:InvstgtnId>
                    <auth001:LglMndtBsis>
                        <auth001:Prgrph>testi</auth001:Prgrph>
                    </auth001:LglMndtBsis>
                    <auth001:CnfdtltySts>true</auth001:CnfdtltySts>
                    <auth001:InvstgtnPrd>
                        <auth001:Dt>
                            <auth001:FrDt>2020-09-01</auth001:FrDt>
                            <auth001:ToDt>2024-08-08</auth001:ToDt>
                        </auth001:Dt>
                    </auth001:InvstgtnPrd>
                    <auth001:SchCrit>
                        <auth001:Acct>
                            <auth001:Id>
                                <auth001:Id>
                                    <auth001:IBAN>FI2933891360008653</auth001:IBAN>
                                </auth001:Id>
                            </auth001:Id>
                            <auth001:InvstgtdPties>
                                <auth001:Cd>ALLP</auth001:Cd>
                            </auth001:InvstgtdPties>
                            <auth001:AuthrtyReqTp>
                                <auth001:MsgNmId>camt.052.001.08</auth001:MsgNmId>
                            </auth001:AuthrtyReqTp>
                        </auth001:Acct>
                    </auth001:SchCrit>
                    <auth001:SplmtryData>
                        <auth001:Envlp>
                            <fin012:Document>
                                <fin012:InfReqFin012>
                                    <fin012:AuthorityInquiry>
                                        <fin012:officialId>Kyselevän viranomaisen tunniste</fin012:officialId>
                                        <fin012:officialSuperiorId>Kyselyn hyväksyjän tunniste</fin012:officialSuperiorId>
                                        <fin012:officialOrgId>Kyselevän viranomaisen organisaation tunniste</fin012:officialOrgId>
                                    </fin012:AuthorityInquiry>
                                    <fin012:InvestigationType>
                                        <fin012:InvestigationTypeCode>BALN</fin012:InvestigationTypeCode>
                                        <fin012:InvestigationTypeCode>TRAN</fin012:InvestigationTypeCode>
                                    </fin012:InvestigationType>
                                    <fin012:AdditionalTransactionInformation>
                                        <fin012:TransactionFieldCode>BAL_CDTLINE_INCL</fin012:TransactionFieldCode>
                                        <fin012:TransactionFieldCode>BAL_CDTLINE_AMT</fin012:TransactionFieldCode>
                                    </fin012:AdditionalTransactionInformation>
                                </fin012:InfReqFin012>
                            </fin012:Document>
                        </auth001:Envlp>
                    </auth001:SplmtryData>
                </auth001:InfReqOpng>
            </auth001:Document>
        </root:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>
